using System.Collections.Generic;

namespace HW_191.Data
{
    public class Repository
    {
        public List<User> Users = new List<User>{
            new User ("1","Ульварсон","Торгейрд","Андерссон","+7 (404) 111-259 ","andersson@gmail.com","Описание1" ),
            new User ("2","Эггилсон","Торгейрд","Виртанен","+7 (404) 111-226 ","virtanen@gmail.com","Описание2" ),
            new User ("3","Джонсон","Ивар","Эйвинд","+7 (404) 121-238 ","jonson@gmail.com","" ),
            new User ("4","Карлсен","Альрик","Рэгнволдсон","+7 (404) 111-227 ","carlsen@gmail.com","" ),
            new User ("5","Корхонен","Зигфрит","Эггилсон","+7 (404) 111-225 ","korkhonen@gmail.com","" ),
            new User ("6","Кристиансен","Рэгнволд","Ойвиндсон","+7 (404) 111-237 ","kristiansen@gmailcom","Описание3" ),
            new User ("7","Иварсон","Вилмар","Ларссон","+7 (404) 111-240 ","larson@gmail.com","" ),
            new User ("8","Мякинен","Торстейн","Севверинсон","+9 888 77 66 553 ","myakinen@gmail.com","" ),
            new User ("9","Расмуссен","Герхард","Зигфритсон","+9 888 77 66 552 ","rasmusen@gmail.com","" ),
            new User ("10","Свенссон","Рагнар","Иварсон","+7 (404) 111-272 ","svenson@gmail.com","" ),
            new User ("11","Ульссон","Эйвинд","Ульрихсон","+7 (404) 111-276 ","ulson@gmail.com","" ),
            new User ("12","Хансен","Торгейрд","Халлстейнсон","+7 (404) 111-271 ","hansen@gmail.com","Описание4" ),
            new User ("13","Хейкинен","Ньорд","Торгейрдсон","+7 (404) 111-273 ","hikeenen@gmail.com","Описание5" ),
            new User ("14","Стейнвульфсон","Севверин","Юханссон","+7 (404) 111-250 ","ukhanson@gmail.com","Описание6" )
        };
    }
}
